Repository: johnpetersa19/cloudflare_warp_panel
Catalog: lib/l10n/app_*.arb
Languages: pt

# appTitle
source: Cloudflare WARP Panel
pt: Painel Cloudflare WARP

source: Connected
pt: Conectado

source: Disconnected
pt: Desconectado

source: Error
pt: Erro

source: Legal Notice
pt: Aviso Legal

source: Data Usage
pt: Uso de Dados

source: Zero Trust Login
pt: Login Zero Trust

# pleaseEnterTeamName
source: Please enter your team name.
pt: Por favor, insira o nome da sua equipe.

# errorRegisteringTeam
source: Error registering team: {stderr}
pt: Erro ao registrar a equipe: {stderr}

# registrationSuccessful
source: Registration successful. Please check your browser to continue.
pt: Registro bem-sucedido. Por favor, verifique seu navegador para continuar.

# fatalErrorWarpCli
source: FATAL ERROR: Failed to execute warp-cli command: {error}
pt: ERRO FATAL: Falha ao executar o comando warp-cli: {error}

# revertedToFreeMode
source: Reverted to free WARP mode. Please check the main dashboard.
pt: Revertido para o modo WARP gratuito. Por favor, verifique o painel principal.

# errorReverting
source: Error reverting to free mode: {error}
pt: Erro ao reverter para o modo gratuito: {error}

source: Your team name
pt: Nome da sua equipe

source: Login via browser
pt: Entrar via navegador

source: Revert to Free WARP
pt: Reverter para o WARP Gratuito

# disconnectedStatus
source: DISCONNECTED
pt: DESCONECTADO

# notPrivateInternet
source: Your Internet is not private.
pt: Sua Internet não está privada.

source: Loading...
pt: Carregando...

source: NOT INSTALLED
pt: NÃO INSTALADO

source: WARP-CLI not found.
pt: warp-cli não encontrado.

# connectedStatus
source: CONNECTED
pt: CONECTADO

# privateInternet
source: Your Internet is private.
pt: Sua Internet está privada.

# connectingStatus
source: CONNECTING...
pt: CONECTANDO...

source: Attempting to connect.
pt: Tentando conectar.

source: STATUS UNKNOWN
pt: STATUS DESCONHECIDO

# couldNotGetStatus
source: Could not get a valid status.
pt: Não foi possível obter um status válido.

# errorWarpCliNotInstalled
source: Error: warp-cli is not installed.
pt: Erro: warp-cli não está instalado.

# errorResultStderr
source: Error: {stderr}
pt: Erro: {stderr}

# errorWarpCliFailed
source: Error: The warp-cli command failed.
pt: Erro: O comando warp-cli falhou.

source: Tunnel Only
pt: Apenas Túnel

source: About Cloudflare
pt: Sobre a Cloudflare

source: Privacy policy
pt: Política de privacidade

source: Terms of service
pt: Termos de serviço

source: Third party licenses
pt: Licenças de terceiros

# version
source: Version {version}
pt: Versão {version}

# copyright
source: Copyright Â© 2023 Cloudflare, Inc.
pt: Copyright © 2023 Cloudflare, Inc.

source: Registration Settings
pt: Configurações de Registro

source: Show registration info
pt: Mostrar informações de registro

source: Delete current registration
pt: Excluir registro atual

source: Register new client
pt: Registrar novo cliente

source: Registration Info
pt: Informações de Registro

source: DNS Settings
pt: Configurações de DNS

source: Show DNS stats
pt: Mostrar estatísticas de DNS

source: Show default fallbacks
pt: Mostrar fallbacks padrão

source: Toggle DNS logging
pt: Alternar registro de DNS

source: Set Fallback Domain
pt: Definir Domínio de Fallback

source: DNS Stats
pt: Estatísticas de DNS

source: Default DNS Fallbacks
pt: Fallbacks de DNS Padrão

source: Proxy Settings
pt: Configurações de Proxy

source: Set Proxy Port
pt: Definir Porta de Proxy

source: Set Port
pt: Definir Porta

source: Trusted Networks
pt: Redes Confiáveis

source: Show Statistics
pt: Mostrar Estatísticas

source: Tunnel Settings
pt: Configurações de Túnel

source: VNet Settings
pt: Configurações de VNet

source: Debug Menu
pt: Menu de Depuração

source: Show Network Info
pt: Mostrar Informações de Rede

source: Show Posture Info
pt: Mostrar Informações de Postura

source: Show DEX data
pt: Mostrar dados DEX

source: Toggle connectivity check
pt: Alternar verificação de conectividade

source: Network Info
pt: Informações de Rede

source: Posture Info
pt: Informações de Postura

source: DEX Data
pt: Dados DEX

source: Connectivity Check
pt: Verificação de Conectividade

source: Tunnel Stats
pt: Estatísticas do Túnel

source: Rotate Tunnel Keys
pt: Rotacionar Chaves do Túnel

# virtualNetwork
source: Virtual Network (VNet)
pt: Rede Virtual (VNet)

# currentVnet
source: Current Vnet: {vnet}
pt: VNet Atual: {vnet}

source: Set New Vnet
pt: Definir Nova VNet

source: Set VNet
pt: Definir VNet

source: VNet Set
pt: VNet Definida

# newVnetSet
source: New VNet has been set to {newVnet}
pt: Nova VNet foi definida para {newVnet}

# confirmLogout
source: Are you sure you want to logout from Cloudflare Zero Trust?
pt: Tem certeza de que deseja sair do Cloudflare Zero Trust?

# logoutDescription
source: After the logout, you will be disassociated from Cloudflare Zero Trust.
pt: Após o logout, você será desassociado do Cloudflare Zero Trust.

source: Cancel
pt: Cancelar

# confirmLogoutButton
source: Confirm logout
pt: Confirmar logout

source: Environment Settings
pt: Configurações de Ambiente

source: Set new environment
pt: Definir novo ambiente

# setButton
source: Set
pt: Definir

# resetButton
source: Reset
pt: Redefinir

source: Environment Status
pt: Status do Ambiente

# mdmConfigs
source: MDM Configurations
pt: Configurações MDM

source: Get MDM configs
pt: Obter configurações MDM

source: Override Settings
pt: Configurações de Substituição

source: Show overrides
pt: Mostrar substituições

source: Unlock policies
pt: Desbloquear políticas

source: Local Network Override
pt: Substituição de Rede Local

source: Override Status
pt: Status de Substituição

source: Targets
pt: Alvos

source: List all targets
pt: Listar todos os alvos

source: Show Certificates
pt: Mostrar Certificados

source: Account Certificates
pt: Certificados da Conta

source: Allow access
pt: Permitir acesso

source: Show access
pt: Mostrar acesso

source: Stop access
pt: Parar acesso

source: Local Network Status
pt: Status da Rede Local

source: Trusted SSIDs
pt: SSIDs Confiáveis

source: List SSIDs
pt: Listar SSIDs

source: Add SSID
pt: Adicionar SSID

source: Remove SSID
pt: Remover SSID

source: Reset SSIDs
pt: Redefinir SSIDs

source: Enter SSID Name
pt: Digite o Nome do SSID

# addButton
source: Add
pt: Adicionar

# removeButton
source: Remove
pt: Remover

# legalNoticeConfirmation
source: Legal Notice and Confirmation
pt: Aviso Legal e Confirmação

# importantInfoPanel
source: Important Information About the Panel
pt: Informações Importantes Sobre o Painel

# appDescription1
source: This app is a graphical control panel (GUI) developed by a user to make it easier to interact with the official Cloudflare WARP program on Linux. It is NOT the official Cloudflare application.
pt: Este aplicativo é um painel de controle gráfico (GUI) desenvolvido por um usuário para facilitar a interação com o programa oficial do Cloudflare WARP no Linux. Ele NÃO é o aplicativo oficial do Cloudflare.

# appDescription2
source: For this panel to work properly, it is ESSENTIAL that you have the official Cloudflare WARP for Linux installed on your system. This project DOES NOT collect ANY user data. Responsibility for the operation, privacy, and security of your internet traffic lies entirely with Cloudflare, as this panel only sends commands to the already installed official WARP program.
pt: Para que este painel funcione corretamente, é ESSENCIAL que você tenha o Cloudflare WARP oficial para Linux instalado em seu sistema. Este projeto NÃO coleta NENHUM dado do usuário. A responsabilidade pela operação, privacidade e segurança do seu tráfego de internet é inteiramente da Cloudflare, pois este painel apenas envia comandos para o programa WARP já instalado.

# confirmationText
source: By clicking "I understand", you confirm that you have read, understood, and accepted the above terms. Your confirmation will be saved locally on your device, and this notice will not be shown again on future launches of the panel.
pt: Ao clicar em "Eu entendi", você confirma que leu, compreendeu e aceitou os termos acima. Sua confirmação será salva localmente em seu dispositivo, e este aviso não será exibido novamente em futuros lançamentos do painel.

source: I understand
pt: Eu entendi

# savingConfirmation
source: Starting the process of saving confirmation...
pt: Iniciando o processo de salvamento da confirmação...

# appSupportDirFound
source: Application support directory found: {path}
pt: Diretório de suporte do aplicativo encontrado: {path}

# checkingPrefsDir
source: Attempting to check if the preferences directory exists: {path}
pt: Tentando verificar se o diretório de preferências existe: {path}

# dirDoesNotExist
source: Directory does not exist. Attempting to create...
pt: O diretório não existe. Tentando criar...

# prefsDirCreated
source: Preferences directory created successfully.
pt: Diretório de preferências criado com sucesso.

# prefsDirExists
source: Preferences directory already exists.
pt: O diretório de preferências já existe.

# hasSeenLegalNoticeSaved
source: The hasSeenLegalNotice preference has been saved successfully.
pt: A preferência hasSeenLegalNotice foi salva com sucesso.

# navigationInitiated
source: Navigation to the main screen initiated.
pt: Navegação para a tela principal iniciada.

# fatalErrorSavePref
source: FATAL ERROR: Failed to save preference or create directory. Details: {error}
pt: ERRO FATAL: Falha ao salvar a preferência ou criar o diretório. Detalhes: {error}

# errorReadNetworkStats
source: ERROR: Failed to read network statistics files: {error}.
pt: ERRO: Falha ao ler arquivos de estatísticas de rede: {error}.

source: Current Speed
pt: Velocidade Atual

source: Total Data Transferred
pt: Total de Dados Transferidos

source: Reset Counters
pt: Redefinir Contadores

source: Connected via WARP
pt: Conectado via WARP

source: Not connected via WARP
pt: Não conectado via WARP

source: Outside WARP
pt: Fora do WARP

# trustedNetworksDialogTitle
source: Trusted Networks
pt: Redes Confiáveis

source: Manage trusted SSIDs
pt: Gerenciar SSIDs confiáveis

source: Toggle trusted Ethernet
pt: Alternar Ethernet confiável

source: Toggle trusted Wi-Fi
pt: Alternar Wi-Fi confiável

source: Settings
pt: Configurações

source: Target List
pt: Lista de Alvos

source: Logout from Zero Trust
pt: Sair do Zero Trust

source: Re-authenticate session
pt: Reautenticar sessão

source: About Zero Trust
pt: Sobre o Zero Trust
